In [1]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
  host="localhost",
  user="ragu",
  password="password"
)

mycursor = mydb.cursor()

In [2]:
# Creating a Database
mycursor.execute(" CREATE DATABASE Datasets")

In [3]:
# SHOW DATABASES
mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('Datasets',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

In [4]:
# Use heights
mycursor.execute("use Datasets")

In [5]:
# Load Datasets to DB-heights
data = pd.read_csv("../Datasets/heights.csv")
data

          height
0     182.395153
1     177.369198
2     182.198838
3     176.988964
4     163.689656
...          ...
9995  172.694718
9996  184.422508
9997  193.775173
9998  185.282704
9999  178.123633

[10000 rows x 1 columns]

In [6]:
# Create Table heights
mycursor.execute("create Table heights(height FLOAT)")

In [7]:
# INSERT VALUES INTO heights
for row in data.itertuples():
    sql = "INSERT INTO heights (height) VALUES (%(height)s)"
    val = {
        "height":row.height
        }  
    mycursor.execute(sql, val)
    mydb.commit()

In [8]:
# Load Datasets to DB-auto_upgrades
data = pd.read_csv("../Datasets/auto_upgrades.csv")
data

    Sales
0    5000
1    1700
2    8200
3    1500
4    3300
5    9000
6    2000
7       0
8       0
9    2300
10   4700

In [9]:
# Create Table auto_upgrades
mycursor.execute("create Table auto_upgrades(Sales INT)")

In [10]:
# INSERT VALUES INTO auto_upgrades
for row in data.itertuples():
    sql = "INSERT INTO auto_upgrades (Sales) VALUES (%(Sales)s)"
    val = {
        "Sales":row.Sales
        }  
    mycursor.execute(sql, val)
    mydb.commit()

In [11]:
# Load Datasets to DB-dealership
data = pd.read_csv("../Datasets/dealership.csv")
data

   Hours       Sales
0     40   179480.58
1     56  2495037.51
2     50  2285369.51
3     82  2367896.33
4     41  1309745.16
5     51   623013.69
6     45  2989943.37
7     90  1970316.24
8     47  1845840.39
9     72  2553231.33

In [12]:
# Create Table dealership
mycursor.execute("create Table dealership(Hours INT , Sales FLOAT)")

In [13]:
# INSERT VALUES INTO dealership
for row in data.itertuples():
    sql = "INSERT INTO dealership (Hours,Sales) VALUES ( %(Hours)s ,%(Sales)s)"
    val = {
        "Hours":row.Hours,
        "Sales":row.Sales
    }  
    mycursor.execute(sql, val)
    mydb.commit()